# CouplerWidth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CouplerWidth Property
ParameterTypeId Class See Also
---
"External Diameter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CouplerWidth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouplerWidth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CouplerWidth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace